<template>
  <div class="page-container -privacy-policy">
    <section class="privacy-policy">
      <PageBackButton />

      <div class="privacy-policy__inner">
        <div class="privacy-policy__content">
          <v-row>
            <v-col>
              <h2>プライバシーポリシー</h2>
              <p>
                このウェブサイト上で提供するClipper（クリッパー）（以下、「本サービス」といいます。）における、ユーザーの個人情報の取扱いについて、以下のとおりプライバシーポリシー（以下、「本ポリシー」といいます。）を定めます。
              </p>
            </v-col>
          </v-row>
          <v-row class="flex-column mt-5">
            <v-col>
              <h3>第1条（個人情報）</h3>
              <p>
                「個人情報」とは、個人情報保護法にいう「個人情報」を指すものとし、生存する個人に関する情報であって、当該情報に含まれる氏名、生年月日、住所、電話番号、連絡先その他の記述等により特定の個人を識別できる情報及び容貌、指紋、声紋にかかるデータ、及び健康保険証の保険者番号などの当該情報単体から特定の個人を識別できる情報（個人識別情報）を指します。
              </p>
            </v-col>
            <v-col>
              <h3>第2条（個人情報の収集方法）</h3>
              <p>
                本サービスでは、ユーザーが利用登録をする際に氏名（本サービスにおけるユーザー名）、メールアドレスなどの個人情報をお尋ねすることがあります。<br>
                なお、本サービスの利用登録情報以外に、本サービスが個人を特定できるような情報を収集することはありません。
              </p>
            </v-col>
            <v-col>
              <h3>第3条（個人情報を収集・利用する目的）</h3>
              <p>
                本サービスが個人情報を収集・利用する目的は、以下のとおりです。
              </p>
              <ol>
                <li>
                  本サービスの提供・運営のため
                </li>
                <li>
                  ユーザーからのお問い合わせに回答するため（本人確認を行うことを含む）
                </li>
                <li>
                  メンテナンス、重要なお知らせなど必要に応じたご連絡のため
                </li>
                <li>
                  利用規約に違反したユーザーや、不正・不当な目的でサービスを利用しようとするユーザーの特定をし、ご利用をお断りするため
                </li>
                <li>
                  ユーザーにご自身の登録情報の閲覧や変更、削除を行っていただくため
                </li>
                <li>
                  上記の利用目的に付随する目的
                </li>
              </ol>
            </v-col>
            <v-col>
              <h3>第4条（利用目的の変更）</h3>
              <ol>
                <li>
                  本サービスは、利用目的が変更前と関連性を有すると合理的に認められる場合に限り、個人情報の利用目的を変更するものとします。
                </li>
                <li>
                  利用目的の変更を行った場合には、変更後の目的について、メールによるユーザーへの通知または本ウェブサイト上に公表するものとします。
                </li>
              </ol>
            </v-col>
            <v-col>
              <h3>第5条（個人情報の第三者提供）</h3>
              <ol>
                <li>
                  本サービスは、次に掲げる場合を除いて、あらかじめユーザーの同意を得ることなく、第三者に個人情報を提供することはありません。ただし、個人情報保護法その他の法令で認められる場合を除きます。
                  <ol>
                    <li>
                      人の生命、身体または財産の保護のために必要がある場合であって、本人の同意を得ることが困難であるとき
                    </li>
                    <li>
                      公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合であって、本人の同意を得ることが困難であるとき
                    </li>
                    <li>
                      国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき
                    </li>
                  </ol>
                </li>
                <li>
                  前項の定めにかかわらず、次に掲げる場合には、当該情報の提供先は第三者に該当しないものとします。
                  <ol>
                    <li>
                      本サービスが利用目的の達成に必要な範囲内において個人情報の取扱いの全部または一部を委託する場合
                    </li>
                    <li>
                      合併その他の事由による事業の承継に伴って個人情報が提供される場合
                    </li>
                    <li>
                      個人情報を特定の者との間で共同して利用する場合であって、その旨並びに共同して利用される個人情報の項目、共同して利用する者の範囲、利用する者の利用目的及び当該個人情報の管理について責任を有する者の氏名または名称について、あらかじめ本人に通知し、または本人が容易に知り得る状態に置いた場合
                    </li>
                  </ol>
                </li>
              </ol>
            </v-col>
            <v-col>
              <h3>第6条（個人情報の開示）</h3>
              <p>
                本サービスにおける個人情報（利用登録時に必要な氏名（本サービスにおけるユーザー名）、メールアドレスなどの情報）は、本サービス内においてユーザーご自身による登録情報の閲覧が可能であるため、本人からの申し出であっても、原則として個人情報は開示致しません。
              </p>
            </v-col>
            <v-col>
              <h3>第7条（個人情報の訂正及び削除）</h3>
              <p>
                本サービスにおける個人情報（利用登録時に必要な氏名（本サービスにおけるユーザー名）、メールアドレスなどの情報）は、本サービス内においてユーザーご自身による登録情報の訂正・削除が可能であるため、本人からの申し出であっても、原則として個人情報の訂正及び削除は致しません。
              </p>
            </v-col>
            <v-col>
              <h3>第8条（個人情報の利用停止等）</h3>
              <ol>
                <li>
                  本サービスは、本人から、個人情報が、利用目的の範囲を超えて取り扱われているという理由、または不正の手段により取得されたものであるという理由により、その利用の停止または消去（以下、「利用停止等」といいます。）を求められた場合には、遅滞なく必要な調査を行います。
                </li>
                <li>
                  前項の調査結果に基づき、その請求に応じる必要があると判断した場合には、遅滞なく、当該個人情報の利用停止等を行います。
                </li>
                <li>
                  本サービスは、前項の規定に基づき利用停止等を行った場合、または利用停止等を行わない旨の決定をしたときは、遅滞なく、これをユーザーに通知します。
                </li>
                <li>
                  前2項にかかわらず、利用停止等に多額の費用を有する場合その他利用停止等を行うことが困難な場合であって、ユーザーの権利利益を保護するために必要なこれに代わるべき措置をとれる場合は、この代替策を講じるものとします。
                </li>
              </ol>
            </v-col>
            <v-col>
              <h3>第9条（プライバシーポリシーの変更）</h3>
              <ol>
                <li>
                  本ポリシーの内容は、法令その他本ポリシーに別段の定めのある事項を除いて、ユーザーに通知することなく、変更することができるものとします。
                </li>
                <li>
                  変更後のプライバシーポリシーは、本ウェブサイトに掲載したときから効力を生じるものとします。
                </li>
              </ol>
            </v-col>
            <v-col class="d-flex justify-end">
              <p>
                以上
              </p>
            </v-col>
          </v-row>
        </div>
      </div>
    </section>
  </div>
</template>

<script lang="ts">
import { defineComponent } from '@vue/composition-api'

export default defineComponent({
  layout: 'beforeAuth'
})
</script>

<style lang="postcss" scoped>
.privacy-policy {
  margin: 80px auto;
  max-width: 880px;

  @media (--sp) {
    margin: 40px auto;
    max-width: 100%;
  }

  & .privacy-policy__content {
    background-color: rgba(97,171,155, .08);
    border: 2px solid var(--color-accent);
    border-radius: 16px;
    margin-top: 20px;
    padding: 40px 32px;

    @media (--sp) {
      margin-top: 12px;
      padding: 20px 16px;
    }

    & h2 {
      border-bottom: 1px solid var(--color-accent);
      letter-spacing: .08em;
      line-height: 2;
      margin-bottom: 12px;
      padding-bottom: 4px;

      @media (--sp) {
        font-size: 20px;
        line-height: 1.75;
      }
    }

    & h3 {
      border-bottom: 1px dotted var(--color-accent);
      letter-spacing: .06em;
      line-height: 2;
      margin-bottom: 8px;
      padding-bottom: 4px;

      @media (--sp) {
        font-size: 16px;
        letter-spacing: .04em;
        line-height: 1.75;
      }
    }

    & p,
    & li {
      font-size: 14px;
      letter-spacing: .028em;
      line-height: 2;

      @media (--sp) {
        font-size: 12px;
        letter-spacing: .02em;
      }
    }
  }
}
</style>