<template>
  <v-container class="terms">
    <PageBackButton />

    <div class="terms__inner">
      <div class="terms__content">
        <v-row>
          <v-col>
            <h2>利用規約</h2>
            <p>
              この利用規約（以下、「本規約」といいます。）は、このウェブサイト上で提供するClipper（クリッパー）（以下、「本サービス」といいます。）の利用条件を定めるものです。<br>
              登録ユーザーの皆さま（以下、「ユーザー」といいます。）には、本規約に従って、本サービスをご利用いただきます。
            </p>
          </v-col>
        </v-row>
        <v-row class="flex-column mt-5">
          <v-col>
            <h3>第1条（適用）</h3>
            <ol>
              <li>
                本規約は、ユーザーと本サービスの利用に関わる一切の関係に適用されるものとします。
              </li>
              <li>
                本サービスに関し、本規約のほか、ご利用にあたってのルール等、各種の定め（以下、「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず、本規約の一部を構成するものとします。
              </li>
              <li>
                本規約の規定が前条の個別規定の規定と矛盾する場合には、個別規定において特段の定めなき限り、個別規定の規定が優先されるものとします。
              </li>
            </ol>
          </v-col>
          <v-col>
            <h3>第2条（メールアドレス及びパスワードの管理）</h3>
            <ol>
              <li>
                ユーザーは、自己の責任において、本サービスのメールアドレス及びパスワードを適切に管理するものとします。
              </li>
              <li>
                ユーザーは、いかなる場合にも、メールアドレス及びパスワードを第三者に譲渡または貸与し、もしくは第三者と共用することはできません。本サービスは、メールアドレスとパスワードの組み合わせが登録情報と一致してログインされた場合には、そのメールアドレスを登録しているユーザー自身による利用とみなします。
              </li>
              <li>
                メールアドレス及びパスワードが第三者によって使用されたことによって生じた損害は、本サービスに故意又は重大な過失がある場合を除き、本サービスは一切の責任を負わないものとします。
              </li>
            </ol>
          </v-col>
          <v-col>
            <h3>第3条（禁止事項）</h3>
            <p>
              ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません。
            </p>
            <ol>
              <li>
                法令または公序良俗に違反する行為
              </li>
              <li>
                犯罪行為に関連する行為
              </li>
              <li>
                本サービスの内容等、本サービスに含まれる著作権、商標権ほか知的財産権を侵害する行為
              </li>
              <li>
                他のユーザー、またはその他第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為
              </li>
              <li>
                本サービスによって得られた情報を商業的に利用する行為
              </li>
              <li>
                本サービスの運営を妨害するおそれのある行為
              </li>
              <li>
                不正アクセスをし、またはこれを試みる行為
              </li>
              <li>
                他のユーザーに関する個人情報等を収集または蓄積する行為
              </li>
              <li>
                不正な目的を持って本サービスを利用する行為
              </li>
              <li>
                本サービスの他のユーザーまたはその他の第三者に不利益、損害、不快感を与える行為
              </li>
              <li>
                他のユーザーに成りすます行為
              </li>
              <li>
                本サービス上での宣伝、広告、勧誘、または営業行為
              </li>
              <li>
                面識のない異性との出会いを目的とした行為
              </li>
              <li>
                本サービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為
              </li>
              <li>
                その他、不適切と判断する行為
              </li>
            </ol>
          </v-col>
          <v-col>
            <h3>第4条（本サービスの提供の停止等）</h3>
            <ol>
              <li>
                以下のいずれかの事由があると判断した場合、ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
                <ol>
                  <li>
                    本サービスにかかるコンピュータシステムの保守点検または更新を行う場合
                  </li>
                  <li>
                    地震、落雷、火災、停電または天災などの不可抗力により、本サービスの提供が困難となった場合
                  </li>
                  <li>
                    コンピュータまたは通信回線等が事故により停止した場合
                  </li>
                  <li>
                    その他、本サービス開発者が本サービスの提供が困難と判断した場合
                  </li>
                </ol>
              </li>
              <li>
                本サービスの提供の停止または中断により、ユーザーまたは第三者が被ったいかなる不利益または損害についても、一切の責任を負わないものとします。
              </li>
            </ol>
          </v-col>
          <v-col>
            <h3>第5条（保証の否認及び免責事項）</h3>
            <ol>
              <li>
                本サービスに事実上または法律上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
              </li>
              <li>
                本サービスに起因してユーザーに生じたあらゆる損害について一切の責任を負いません。ただし、本サービスに関する本サービスとユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合、この免責規定は適用されません。
              </li>
              <li>
                前項ただし書に定める場合であっても、本サービスの運営上の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（本サービスまたはユーザーが損害発生につき予見し、または予見し得た場合を含みます。）について一切の責任を負いません。また、本サービスの過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害の賠償は、ユーザーから当該損害が発生した月に受領した利用料の額を上限とします。<br>
                本サービスに関して、ユーザーと他のユーザーまたは第三者との間において生じた取引、連絡または紛争等について一切責任を負いません。
              </li>
            </ol>
          </v-col>
          <v-col>
            <h3>第6条（サービス内容の変更等）</h3>
            <p>
              ユーザーに通知することなく、本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし、これによってユーザーに生じた損害について一切の責任を負いません。
            </p>
          </v-col>
          <v-col>
            <h3>第7条（利用規約の変更）</h3>
            <p>
              必要と判断した場合には、ユーザーに通知することなくいつでも本規約を変更することができるものとします。なお、本規約の変更後、本サービスの利用を開始した場合には、当該ユーザーは変更後の規約に同意したものとみなします。
            </p>
          </v-col>
          <v-col>
            <h3>第8条（個人情報の取扱い）</h3>
            <p>
              本サービスの利用によって取得する個人情報については、本サービス「<a href="/privacy-policy/" target="_self">プライバシーポリシー</a>」に従い適切に取り扱うものとします。
            </p>
          </v-col>
        </v-row>
      </div>
    </div>
  </v-container>
</template>

<script lang="ts">
import { defineComponent } from '@vue/composition-api'

export default defineComponent({
  layout: 'beforeAuth'
})
</script>

<style lang="postcss" scoped>
.terms {
  margin: 80px auto;
  max-width: 880px;

  @media (--sp) {
    margin: 40px auto;
    max-width: 100%;
  }

  & .terms__content {
    background-color: rgba(97,171,155, .08);
    border: 2px solid var(--color-accent);
    border-radius: 16px;
    margin-top: 20px;
    padding: 40px 32px;

    @media (--sp) {
      margin-top: 12px;
      padding: 20px 16px;
    }

    & h2 {
      border-bottom: 1px solid var(--color-accent);
      letter-spacing: .08em;
      line-height: 2;
      margin-bottom: 12px;
      padding-bottom: 4px;

      @media (--sp) {
        font-size: 20px;
        line-height: 1.75;
      }
    }

    & h3 {
      border-bottom: 1px dotted var(--color-accent);
      letter-spacing: .06em;
      line-height: 2;
      margin-bottom: 8px;
      padding-bottom: 4px;

      @media (--sp) {
        font-size: 16px;
        letter-spacing: .04em;
        line-height: 1.75;
      }
    }

    & p,
    & li {
      font-size: 14px;
      letter-spacing: .028em;
      line-height: 2;

      @media (--sp) {
        font-size: 12px;
        letter-spacing: .02em;
      }
    }
  }
}
</style>